{
  "intents": [
    {
      "tag": "attendance",
      "patterns": [
        "Do I have to go to class?",
        "Is attendance required?",
        "Should I go to lecture?",
        "Do I need to attend lecture?",
        "Is attendance mandatory?",
        "Do I have to show up for class?",
        "Is it necessary to attend every class?",
        "Is going to lecture important?",
        "Do I have to be present for all lectures?",
        "Do I need to be physically in class?",
        "Is class attendance compulsory?",
        "Am I expected to attend all lectures?",
        "Is it mandatory to be present in class?",
        "Is it essential to attend class regularly?",
        "Is attending class necessary for success in the course?",
        "Is it a requirement to show up for class?",
        "Is attending class optional or required?",
        "Is it necessary to show up for every class?",
        "Is it recommended that I attend lectures?",
        "Do I have to be present at all of the lectures?",
        "Is attendance mandatory or optional?",
        "Is it required for me to be present in class?",
        "Is it necessary to attend all classes?",
        "How important is attending lectures?",
        "Am I expected to attend every lecture?",
        "Is physical attendance necessary in class?",
        "Do I need to attend class as part of the course requirement?",
        "Is attendance at all lectures mandatory?",
        "Do I have to be in class all the time?",
        "How essential is it to attend class regularly?",
        "Is class attendance crucial for succeeding in the course?",
        "Is it compulsory to show up for every class?"
      ],
      "responses": [
        "It is highly recommended that you attend lecture. However, it is not required."
      ]
    },
    {
      "tag": "lateWork",
      "patterns": [
        "Is there a penalty for submitting assignments late?",
        "Will I lose points if I turn in my project late?",
        "Can I submit my homework late?",
        "What is the late policy for assignments and projects?",
        "Is there a grace period for late submissions, or are they not accepted at all?",
        "How much will my grade be docked for submitting an assignment late?",
        "Are there any exceptions to the late submission policy, such as medical or personal emergencies?",
        "Will I receive any feedback or comments on assignments or projects that are submitted late?",
        "Can I request an extension for a deadline if I am unable to submit my work on time?",
        "Is there a limit to the number of times I can submit an assignment late?",
        "Will late submissions be graded differently than those submitted on time?",
        "Is there a specific format or procedure for submitting late work, such as submitting a separate form or notifying the instructor?",
        "Are there any restrictions on which assignments or projects can be submitted late, such as only allowing late submissions for certain types of assignments?",
        "Will the deadline for submitting late work be different than the original deadline?",
        "Will I still receive credit for late work, even if it is not graded as high as work submitted on time?",
        "Will the late submission policy be different for different types of assignments, such as homework versus exams or projects?",
        "Does submitting assignments late result in a penalty?",
        "Is there a deduction in points for turning in projects late?",
        "Is it permissible to submit homework past the due date?",
        "What is the policy for submitting assignments and projects late?",
        "Is there a grace period for late submissions, or are they completely unacceptable?",
        "What is the extent of the grade reduction for late assignment submission?",
        "Are there any exemptions to the late submission policy, such as for medical or personal emergencies?",
        "Will feedback or comments be given on assignments or projects that are submitted late?",
        "If I am unable to submit my work on time, can I ask for a deadline extension?",
        "Is there a limit to the number of times I can submit an assignment after the due date?",
        "Will late submissions be graded differently than those submitted on time?",
        "Is there a specific format or procedure for submitting late work, such as a separate form or informing the instructor?",
        "Are there any limitations on which assignments or projects can be submitted late, such as only allowing late submissions for certain types of assignments?",
        "Will the deadline for submitting late work differ from the original deadline?",
        "Even if late work is not graded as high as work submitted on time, will I still receive credit for it?",
        "Will the late submission policy vary for different types of assignments, such as homework versus exams or projects?"
      ],
      "responses": [
        "I do not know if there is a penalty for submitting work late. I'm Sorry."
      ]
    },
    {
      "tag": "grading",
      "patterns": [
        "How much is the project worth?",
        "How much is the exam worth?",
        "How much is the midterm worth towards my overall grade?",
        "How much will homework be worth towards my final grade?",
        "How will I be graded?",
        "Is there any extra credit available to boost my grade?",
        "How will attendance or participation be factored into my final grade?",
        "How will final grades be calculated and rounded?",
        "Will there be any curve applied to the grading scale?",
        "How will attendance and participation in class discussions be factored into my grade?",
        "How much weight does the midterm carry towards my final grade?",
        "How much will completing homework contribute to my overall grade?",
        "What is the grading system for this class?",
        "Is there any opportunity for extra credit to improve my grade?",
        "Will attendance or participation impact my final grade, and if so, how?",
        "How will my final grade be determined and rounded?",
        "Will there be any curve applied to the grading scale?",
        "How will class attendance and participation in discussions affect my grade?",
        "What is the weight of the exam?",
        "How much does the midterm count towards my final grade?",
        "How much does homework affect my overall grade?",
        "How will I be evaluated?",
        "Is there any chance to earn extra credit to enhance my grade?",
        "How will attendance and participation be considered in my final grade?",
        "How will the final grades be computed and rounded?",
        "Will the grading scale be curved?",
        "How will participation in class discussions and attendance impact my grade?",
        "What percentage of the final grade is the midterm worth?",
        "How much does completing homework contribute to my overall grade?",
        "What grading system is used in this course?",
        "Are there any opportunities for extra credit to improve my grade?",
        "Will attendance and participation affect my final grade, and if yes, how?",
        "How will my final grade be calculated and rounded?",
        "Will there be a curve applied to the grading scale?",
        "How will class participation and attendance affect my grade?"
      ],
      "responses": [
        "The midterm is worth 20%, the Project is worth 40%, and each assignment is worth 20%."
      ]
    },
    {
      "tag": "projectGroups",
      "patterns": [
        "Do we have to work in groups for the final project?",
        "Can I work with my friend for the final project?",
        "Am I allowed to work with other students for the project",
        "Can I work on my own for the project?",
        "How many people can be in a project group?",
        "Are there any restrictions on who I can work with for the final project?",
        "Can I work with students from other sections for the final project?",
        "Is there a way to find a project team if I don't have one already?",
        "How will group projects be graded?",
        "Do all members of a project group receive the same grade?",
        "Can we switch group members during the project?",
        "Do all team members have to present the final project?",
        "How do we submit our final project as a group?",
        "Can we work with people from outside the class for the final project?",
        "What if I can't find anyone to work with for the final project?",
        "Can we have more than three people in a project group if we get permission?",
        "Will we have to work with a group for the final project?",
        "Is it okay if I team up with my friend for the final project?",
        "Can I collaborate with other students on the project?",
        "Is it allowed to work independently on the project?",
        "What is the maximum team size for the project?",
        "Are there any limitations on who I can partner with for the final project?",
        "Can we collaborate with students from other sections on the final project?",
        "How can I find a group for the project if I don't have one?",
        "What is the grading process for group projects?",
        "Do all group members get the same grade for the final project?",
        "Can we change group members during the project?",
        "Is it mandatory for all members of the group to present the final project?",
        "What is the process for submitting our final project as a group?",
        "Can we work with people outside of the class for the final project?",
        "What if I can't find anyone to work with for the final project?",
        "Is it possible to have more than three people in a project team if we get approval?"
      ],
      "responses": [
        "You may work on your project in groups of 1-3 students."
      ]
    },
    {
      "tag": "project",
      "patterns": [
        "Do we have a final project?",
        "When is the final project due?",
        "Do I get extra credit for presenting my final project?",
        "Do I have to present my project?",
        "Is there a final project for CS 472?",
        "What is the deadline for submitting the final project?",
        "Will I receive extra points for delivering a presentation on my final project?",
        "Is presenting the final project mandatory?",
        "When is the final project presentation?",
        "What is the final project all about?",
        "How will the final project be graded?",
        "Can I choose any topic for the final project?",
        "Are there any specific requirements for the project?",
        "How long should the final project be?",
        "What happens if I don't present my final project?",
        "Can I present my final project remotely?",
        "Who will be grading the final project?",
        "Are we required to complete a final project?",
        "When do I need to turn in the final project?",
        "Is there any bonus credit for presenting my final project?",
        "Do I have to do a presentation as part of the final project?",
        "Does CS 472 have a final project?",
        "What is the final project submission deadline?",
        "Will I receive additional points for giving a presentation on my final project?",
        "Is it mandatory to give a presentation for the final project?",
        "When is the final project presentation scheduled?",
        "What is the topic of the final project?",
        "How will the final project be evaluated?",
        "Can I select any subject for my final project?",
        "Are there any specific guidelines or prerequisites for the final project?",
        "What should be the length of the final project?",
        "What will happen if I do not present my final project?",
        "Is it possible to present my final project remotely?"
      ],
      "responses": [
        "CS 472 has a final project that is due on Monday of week 11. You may present your project in week 10 for extra credit"
      ]
    },
    {
      "tag": "midtermDetails",
      "patterns": [
        "Do we have a midterm?",
        "When is the midterm?",
        "Where is the midterm?",
        "Will the midterm be take home?",
        "What date is the midterm scheduled for?",
        "Where will the midterm be held?",
        "Is the midterm open book?",
        "What time does the midterm start?",
        "How long will the midterm be?",
        "Will there be any extra time provided for the midterm?",
        "Can I use a calculator during the midterm?",
        "Is the format of the midterm multiple choice or essay-based?",
        "Are there any materials I should bring to the midterm?",
        "Will the midterm exam be open notes or closed notes?",
        "Can I bring notes to the midterm?",
        "Is the midterm open note?",
        "Can I use a calculator on the midterm?",
        "Are we going to have a midterm?",
        "When is the midterm going to take place?",
        "Where will the midterm be held?",
        "Will the midterm be a take-home exam?",
        "On what date is the midterm scheduled?",
        "What is the location for the midterm?",
        "Are we allowed to use our textbooks or notes during the midterm?",
        "At what time will the midterm start?",
        "What will be the duration of the midterm?",
        "Will extra time be given during the midterm?",
        "Are we allowed to use calculators during the midterm?",
        "Will the midterm be in a multiple-choice or essay format?",
        "Is there anything that I should bring to the midterm?",
        "Will the midterm be an open-notes or closed-notes exam?",
        "Can I bring my own notes to the midterm?",
        "Will we be allowed to refer to our notes during the midterm?",
        "Can we use a calculator during the midterm?"
      ],
      "responses": [
        "CS 472 has one midterm exam. The exam will be closed-book, no calculator, and will take place in-class on Thursday of week 5."
      ]
    },
    {
      "tag": "midtermContent",
      "patterns": [
        "What should I study for the midterm exam?",
        "What content will be on the midterm?",
        "Will CNNs be on the exam?",
        "Will GANs be on the midterm?",
        "What types of questions should I expect on the midterm?",
        "Are there any specific topics or concepts that I should focus on for the exam?",
        "Will there be any calculations or formulas that I need to memorize for the midterm?",
        "Are there any recommended study strategies for this course or exam?",
        "Will the exam cover material from both the lectures and the readings?",
        "Can you provide any additional resources or study materials to help me prepare for the midterm?",
        "Are there any practice exams or sample questions available for me to review before the exam?",
        "Will the exam be open-book or closed-book?",
        "Will the exam be multiple choice, short answer, essay, or a combination of these formats?",
        "Are there any specific examples or case studies that I should be familiar with for the midterm?",
        "Are there any important definitions or key terms that I should know for the midterm?",
        "Will the exam focus more on theoretical or practical concepts?",
        "Do I need to write code on the midterm?",
        "How much Pytorch will be on the exam?",
        "Is there any specific software or tools that I need to be familiar with for the midterm?",
        "What do I need to study for the midterm exam?",
        "What topics will the midterm cover?",
        "Will we be tested on CNNs during the exam?",
        "Will the midterm include questions about GANs?",
        "What kind of questions can I expect on the midterm?",
        "Are there any particular concepts or subjects that I should concentrate on for the exam?",
        "Will I need to memorize any formulas or perform calculations on the midterm?",
        "Are there any study techniques or resources that you suggest for this course or exam?",
        "Will the exam cover material from both the lectures and readings?",
        "Can you recommend any additional study materials or resources to help me prepare for the midterm?",
        "Are there any practice exams or sample questions available for me to review before the exam?",
        "Will the exam be open-book or closed-book?",
        "What kind of questions will be on the exam? Multiple-choice, short answer, essay, or a mix of these formats?",
        "Are there any particular examples or case studies that I should be familiar with for the midterm?",
        "What are the important definitions or key terms that I should be aware of for the midterm?",
        "Will the exam concentrate more on theoretical or practical concepts?",
        "Will I be required to write code on the midterm?",
        "How much emphasis will be placed on Pytorch during the exam?",
        "Is there any particular software or tools that I should be acquainted with for the midterm?"
      ],
      "responses": [
        "The midterm will have short response questions and will cover subjects like CNNS, Perceptrons, etc. You should understand basic PyTorch."
      ]
    },
    {
      "tag": "finalDetails",
      "patterns": [
        "Do we have a final?",
        "When is the final exam?",
        "What time is the final exam?",
        "Will the midterm be take home?",
        "What should I study for the final exam?",
        "Is there a final project for this course?",
        "Will the final exam be cumulative or only cover material from the second half of the course?",
        "How long will the final exam be?",
        "Will the final exam be in-person or online?",
        "What percentage of my final grade will be determined by the final exam?",
        "Will there be any review sessions or study guides provided for the final exam?",
        "Can I bring notes or other materials with me to the final exam?",
        "Are there any specific topics or concepts that I should focus on for the final exam?",
        "Will there be any extra credit opportunities for the final exam?",
        "Will the final exam be multiple choice, short answer, essay, or a combination of these formats?",
        "Are there any specific examples or case studies that I should be familiar with for the final exam?",
        "Can I request any accommodations or extra time for the final exam?",
        "Will there be any penalties for missing the final exam?",
        "Is attendance mandatory for the final exam?",
        "Can I take the final exam at a different time if I have a scheduling conflict?",
        "Will there be a final exam for this course?",
        "When is the date for the final exam?",
        "What time does the final exam start?",
        "Is the midterm going to be a take-home exam?",
        "What topics or materials should I focus on for the final exam?",
        "Do we have to complete a final project for this course?",
        "Will the final exam cover all material or only the second half of the course?",
        "How long will the final exam last?",
        "Will the final exam be held in-person or online?",
        "What percentage of my final grade will be based on the final exam?",
        "Will there be any review sessions or study guides available for the final exam?",
        "Am I allowed to bring any notes or materials with me to the final exam?",
        "Are there any specific concepts or topics that I should concentrate on for the final exam?",
        "Will there be any opportunities for extra credit on the final exam?",
        "What format will the final exam be in? Multiple choice, short answer, essay, or a combination of these?",
        "Are there any case studies or examples that I need to be familiar with for the final exam?",
        "Can I request any special accommodations or extra time for the final exam?",
        "Will there be any penalties for missing the final exam?",
        "Is attendance required for the final exam?",
        "If I have a scheduling conflict, can I take the final exam at a different time?"
      ],
      "responses": [
        "CS 472 does not have a final exam"
      ]
    },
    {
      "tag": "cheatingPolicy",
      "patterns": [
        "What is the definition of plagiarism in this course?",
        "Can I collaborate with other students on assignments in this course?",
        "Is it acceptable to copy material from online sources for assignments in this course?",
        "Can I use work I completed for a different course in an assignment for this course?",
        "Is it okay to discuss the assignments with other students?",
        "What is the difference between collaboration and collusion in this course?",
        "Are there any exceptions to the academic honesty policy for this course?",
        "What is the definition of collusion in this course?",
        "What constitutes as plagiarism in this course?",
        "Is it okay to use material from other courses for assignments in this course?",
        "What are the expectations for academic honesty in this course?",
        "What is the university's definition of academic honesty?",
        "What counts as plagiarism according to this policy?",
        "What is the policy on collaborating with other students on assignments?",
        "Are there any exceptions to the academic honesty policy?",
        "What precautions should I take to protect my work from being copied?",
        "Is it okay to use online sources for assignments as long as they are cited?",
        "What are the guidelines for citing sources in assignments?",
        "How can I make sure I am not accidentally plagiarizing?",
        "What should I do if I am unsure if something is considered plagiarism?",
        "Are there any specific penalties for not protecting my work from being copied?",
        "What is the university's policy on self-plagiarism?",
        "What should I do if I find out someone has copied my work?",
        "What is the process for reporting suspected plagiarism or collusion?",
        "What is the role of the instructor in enforcing the academic honesty policy?",
        "What resources are available to help me understand and comply with the academic honesty policy?"
      ],
      "responses": [
        "The academic honesty policy for the course requires that all projects submitted must be original work and prohibits copying from other sources. Collaboration is allowed but must be clearly credited, and failure to do so is considered plagiarism." 
      ]
    },
    {
      "tag": "cheatingConsequences",
      "patterns": [
        "What are the consequences of academic dishonesty in this course?",
        "What should I do if I accidentally plagiarize in an assignment?",
        "How will I know if my work is considered plagiarism in this course?",
        "What are the penalties for academic dishonesty in this course?",
        "What if I accidentally include another student's work in my assignment?",
        "How can I ensure that I am not plagiarizing in my assignments?",
        "What are the consequences of failing to properly cite sources in my assignments?",
        "How can I avoid unintentional plagiarism in my assignments?",
        "What happens if I am caught plagiarizing in this course?",
        "What is the penalty for collusion in this course?",
        "How will I be graded if I am found guilty of academic dishonesty in this course?",
        "Is academic dishonesty taken seriously in this course?",
        "What are the potential consequences of cheating on an exam in this course?",
        "Can academic dishonesty lead to expulsion from the university?",
        "What is the process for determining the consequences of academic dishonesty in this course?",
        "What happens if a student is caught cheating more than once in this course?",
        "Is there any leniency for first-time offenders of academic dishonesty in this course?",
        "What are the consequences if I am found guilty of plagiarism on a major project?",
        "Can academic dishonesty affect my future career prospects?",
        "Will my academic dishonesty be noted on my academic record?",
        "Can the consequences of academic dishonesty vary depending on the severity of the offense?",
        "What happens if I cheat in a group project but only one member is caught?",
        "What is the process for appealing the consequences of academic dishonesty in this course?",
        "Can a student be banned from taking further courses in this department if they are found guilty of academic dishonesty?",
        "Are there any consequences for a student who witnesses academic dishonesty but does not report it?",
        "How can I rebuild my academic integrity after being found guilty of academic dishonesty in this course?"
      ],
      "responses": [
        "Cases of dishonesty will be handled according to university policy. Students are responsible for taking reasonable precautions to protect their work, and turning in someone else's code is considered collusion and will result in a failing grade for all involved parties."
      ]
    },
    {
      "tag": "cheatingReporting",
      "patterns": [
        "What should I do if I suspect a fellow student of academic dishonesty?",
        "How can I report academic dishonesty?",
        "Should I tell the the professor if I see a classmate cheating?",
        "What is the role of the instructor in cases of academic dishonesty?",
        "What should I do if I find out that someone has copied my work?",
        "What is the instructor's role in preventing academic dishonesty in this course?",
        "What is the university's stance on academic dishonesty?",
        "What is the procedure for appealing a penalty for academic dishonesty in this course?",
        "How can I report academic dishonesty in this course while protecting my anonymity?",
        "What is the process for reporting academic dishonesty in this course?",
        "What evidence should I gather if I suspect a classmate of academic dishonesty?",
        "Can I report academic dishonesty anonymously?",
        "Will my identity be kept confidential if I report academic dishonesty?",
        "What happens after I report a suspected case of academic dishonesty?",
        "Who should I contact if I suspect academic dishonesty but am not sure how to proceed?",
        "What are the consequences for falsely accusing a student of academic dishonesty?",
        "How can I ensure that my report of academic dishonesty is taken seriously?",
        "What resources are available to me if I experience retaliation for reporting academic dishonesty?",
        "What steps does the university take to investigate reports of academic dishonesty?",
        "What role do other students play in reporting academic dishonesty?",
        "Can I report academic dishonesty that I witness outside of class?",
        "What is the university's policy on anonymous reporting of academic dishonesty?",
        "Can I report academic dishonesty after the assignment or course has ended?",
        "What should I do if I witness academic dishonesty during an exam?"
      ],
      "responses": [
        "If you suspect academic dishonesty is occuring, you should report it to the instructor or CS department as soon as possible."
      ]
    },
    {
      "tag": "topics",
      "patterns": [
        "What will I learn in this course?",
        "What topics will we cover?",
        "What are the main topics of CS 472?",
        "What kind of techniques will be covered in this course?",
        "What is the focus of CS 472?",
        "Can you tell me what CS 472 is all about?",
        "What is the course content of CS 472?",
        "What will I gain from taking this course?",
        "What is the main subject of CS 472?",
        "What can I expect to learn from CS 472?",
        "Will this course cover deep learning techniques?",
        "What are some of the tools we will use in CS 472?",
        "Will PyTorch be covered in this course?",
        "What is the significance of PyTorch in this course?",
        "What is the role of PyTorch in deep learning?",
        "What are some of the deep learning techniques we will learn in CS 472?",
        "Will we be introduced to GANs in this course?",
        "What is the importance of attention in deep learning?",
        "Will we be learning about diffusion models in this course?",
        "What is the relevance of diffusion models in deep learning?",
        "What is the focus of the first week of CS 472?",
        "What are some of the topics covered in week 3 of CS 472?",
        "What is the focus of week 6 in CS 472?",
        "What are the key takeaways from the week 8 lectures?",
        "Can you tell me what content we will learn?"
      ],
      "responses": [
        "In CS 472, students will learn about deep learning techniques, how to use PyTorch, Generative Adversarial Networks (GANs), Attention and Transformers, Variational Autoencoders (VAEs), Diffusion Models, and more. The course covers both basic and advanced topics in deep learning, and also includes presentations by students on relevant research papers."
      ]
    },
    {
      "tag": "officeHours",
      "patterns": [
        "What time are office hours?",
        "When are office hours?",
        "When can I meet with the professor outside of class?",
        "When can I meet with the TA outside of class?",
        "What are the office hours for Professor Shi and Steven Walton?",
        "When is Steven Walton available to meet with students outside of class?",
        "Could you please tell me the location of Professor Shi's office?",
        "What is the best way to contact Steven Walton during their office hours?",
        "Can I schedule an appointment with Professor Shi outside of their office hours?",
        "Does Steven Walton hold office hours during the weekend?",
        "Can you tell me the office hours for Professor Shi for next week?",
        "What is the maximum amount of time I can spend with Professor Shi during office hours?",
        "Do I need to make an appointment to meet with Steven Walton during their office hours?",
        "Are there any changes to Steven Walton's office hours for this week?",
        "How long does Steven Walton hold office hours on Mondays?",
        "What is the preferred method of communication with Professor Shi during office hours?",
        "Can you provide me with a list of topics that Steven Walton can help me with during their office hours?",
        "What is the latest time I can arrive for Steven Walton's office hours?",
        "Can I bring a friend or classmate to the office hours with me?",
        "Can you recommend a good time to meet with Professor Shi during their office hours?",
        "Do I need to sign up in advance to meet with Steven Walton during their office hours?",
        "Can you tell me if Professor Shi's office is handicap-accessible?",
        "Are there any restrictions or limitations to the amount of questions I can ask during office hours?",
        "Is Steven Walton available to meet with me outside of their office hours?",
        "What are the busiest times for Professor Shi's office hours?",
        "Can I schedule a virtual meeting with Steven Walton during their office hours?",
        "Can you tell me what specific course-related questions Steven Walton can help me with during their office hours?",
        "What is the email address I can use to contact Professor Shi during their office hours?",
        "Can I still meet with Steven Walton during their office hours if I missed their class that day?",
        "Can I meet with Professor Shi during office hours if I am not currently enrolled in their course?",
        "Do I need to bring anything specific to meet with Steven Walton during their office hours?",
        "Can you tell me the office hours for Professor Shi during finals week?",
        "What is the average wait time to meet with Steven Walton during their office hours?",
        "Do I need to make an appointment to meet with Professor Shi during their office hours?",
        "Can Steven Walton help me with questions related to the course syllabus during their office hours?",
        "What are the policies regarding late arrivals to Steven Walton's office hours?",
        "Can I still meet with Professor Shi during office hours if I have already graduated from the course?",
        "Are there any specific guidelines for asking questions during Steven Walton's office hours?",
        "Can you tell me the earliest time I can arrive for Professor Shi's office hours?",
        "What is the process for rescheduling a meeting with Steven Walton during their office hours?",
        "Can I meet with Professor Shi during office hours if I need help with a personal matter?",
        "What is the best way to prepare for meeting with Steven Walton during their office hours?",
        "Can you tell me if there are any group study sessions during Professor Shi's office hours?"
      ],
      "responses": [
        "Professor Shi and Steven Walton have office hours by appointment only. Please contact either of them to schedule an appointment."
      ]
    },
    {
      "tag": "lectureLocation",
      "patterns": [
        "What building will class be in?",
        "What room will class be in?",
        "Where is the lecture room for CS 472 located?",
        "What is the location of the lecture room for this course?",
        "What is the physical address of the building where the lectures are held?",
        "What building is the lecture room for CS 472 located in?",
        "What is the room number of the lecture room for this course?",
        "Can you tell me the name of the building where the lecture room is located?",
        "What is the name of the lecture room for CS 472?",
        "Where can I find the lecture room for CS 472?",
        "Can you tell me where the lecture room for this course is located?",
        "What is the street address of the building where the lectures are held?",
        "Which building houses the lecture room for CS 472?",
        "Do you happen to know the number of the lecture room for this course?",
        "Could you give me the name of the building where the lecture room is situated?",
        "What is the designated name of the lecture room for CS 472?",
        "where's the lecture room for CS 472 at?",
        "where's the lecture room for this class?",
        "Do you know where lectures will be held?",
        "where's class?",
        "where is class?",
        "can you tell me where lectures take place?",
        "where will lecture be?",
        "do you know where lecture is?",
        "What's the address for the building where we have class?",
        "Which building is the lecture room for CS 472 in?",
        "What's the room number for class?",
        "What's the name of the building where we have class?",
        "What's the name of our classroom?"
      ],
      "responses": [
        "Lectures are located in room 166 in Lawrence hall"
      ]
    },
    {
      "tag": "language",
      "patterns": [
        "What programming language will we primarily use in this course?",
        "Do you know if we will be developing our models in PyTorch?",
        "Will we use Python?",
        "Should I learn how to use python for this course?", 
        "What is PyTorch and how will we be using it in this course?",
        "Are there any other machine learning libraries or tools we will be using in addition to PyTorch?",
        "Will we be using TensorFlow in this course, and if so, how extensively?",
        "What is Jupyter notebook and how will we be using it in this course?",
        "Can you describe any specific Python libraries we will be using frequently in this course?",
        "Will we need to install any particular software or tools to complete the course assignments?",
        "What is the difference between Python 2 and Python 3, and which one will we be using in this course?",
        "How will we be using Python notebooks to complete assignments in this course?",
        "Which programming language will be the main focus of this course?",
        "Is it expected that we will use PyTorch for developing our models?",
        "Is Python going to be used in this course?",
        "Do I need to have knowledge of Python to take this course?",
        "Could you explain what PyTorch is and how it will be utilized in the course?",
        "In addition to PyTorch, will there be other machine learning libraries or tools used in this course?",
        "Will TensorFlow be a part of the curriculum, and if so, to what extent?",
        "Can you explain Jupyter notebook and its role in the course?",
        "Could you provide some examples of Python libraries we will use frequently in the course?",
        "Are there any specific software or tools we need to install to complete the assignments in this course?",
        "What are the differences between Python 2 and Python 3, and which version will be used in this course?",
        "How will Python notebooks be utilized to complete assignments for this course?"
      ],
      "responses": [
        "This course will primarily use Python, a versatile and popular programming language, in conjunction with PyTorch, a powerful open-source machine learning library, for a wide range of tasks including data analysis, machine learning, and AI development."
      ]
    },
    {
      "tag": "zoom",
      "patterns": [
        "Can I attend classes remotely if I am not feeling well?",
        "Is it possible for me to participate in classes virtually if I'm not feeling well?",
        "In the event of feeling unwell, would it be feasible for me to attend classes remotely?",
        "If I'm experiencing symptoms, am I able to join classes through remote means?",
        "Can I participate remotely if I live in a different time zone?",
        "Will there be accommodations for students who are unable to attend live lectures due to technical difficulties?",
        "Can I still receive participation credit if I join the Zoom meeting late?",
        "Do you have the zoom link?",
        "Do you have the microsft teams link?",
        "What is the lecture zoom link?",
        "Is lecture available on zoom?",
        "What should I do if I cannot make it to a live lecture due to an emergency?",
        "What are the technical requirements for remote participation in the course?",
        "How will remote participants be able to ask questions during lectures?",
        "Can I participate in group projects virtually?",
        "Are office hours also available remotely?",
        "Is there a maximum number of students who can participate remotely in each lecture?",
        "Can I switch between remote and in-person participation throughout the course?",
        "What is the policy for late or missed assignments for remote participants?",
        "Will there be any remote-only activities or events for the course?",
        "Is there a preferred method of communication for remote participants to contact the professor or TA?",
        "What is the process for submitting assignments virtually?",
        "Can I still participate in class discussions remotely?",
        "Will there be any difference in the grading criteria for remote participants compared to in-person participants?",
        "How will group assignments be organized for remote participants?",
        "Is there a deadline to decide if I want to participate remotely or in-person?",
        "What is the best way to access lecture materials as a remote participant?",
        "Are there any limitations to remote participation that I should be aware of?",
        "Can I participate in class discussions through a chat feature during the lecture?",
        "What do I do if I am having trouble connecting to the Zoom meeting as a remote participant?",
        "How will attendance be taken for remote participants?",
        "What should I do if I experience technical difficulties during a live lecture as a remote participant?",
        "Is there a difference in tuition or fees for remote participants compared to in-person participants?",
        "Can I still participate in group office hours remotely?",
        "How will I know if there are any updates or changes to the remote participation policy?",
        "Is there a maximum number of remote participants for the course?",
        "Can I access the course materials and recordings after the course is over as a remote participant?",
        "Will there be any opportunities for remote participants to collaborate with in-person participants?",
        "Can I participate remotely if I am studying abroad or on a leave of absence?"
      ],
      "responses": [
        "Live lectures will often be viewable by joining the zoom meeting via the following link: https://uoregon.zoom.us/j/91353372386?pwd=MnBMVUh4VC9lU3A3UlJQUmRLY0RjZz09"
      ]
    },
    {
      "tag": "accomadations",
      "patterns": [
        "I have trouble reading small text due to my condition. Is there a way to enlarge the text in the course materials?",
        "My disability makes it hard for me to sit for long periods. Will I be able to take breaks during class?",
        "I have difficulty hearing. Will there be captioning or transcripts available for lectures and videos?",
        "Is there a quiet space available for students with sensory sensitivities to take exams?",
        "I have dyslexia and struggle with reading quickly. Can I use assistive technology to help with reading in this class?",
        "I have trouble focusing in a noisy environment. Will the classroom be quiet during lectures?",
        "I have a service animal that I need with me at all times. Is it allowed in the classroom and on campus?",
        "I need to use a wheelchair to get around. Is the classroom accessible and are there accessible entrances to the building?",
        "I have anxiety and panic attacks. Is there a way for me to take exams in a low-stress environment?",
        "I have a learning disability that affects my writing ability. Will there be accommodations for writing assignments in this course?",
        "can I get notetaking support for my condition?",
        "I have a condition that affects my memory. Is there a way to get audio recordings of the lectures for review?",
        "I am on the autism spectrum and have difficulty with social interaction. Are there any resources available to help me feel more comfortable in the classroom?",
        "I have chronic pain that affects my ability to attend class regularly. Is there a way for me to access course materials online?",
        "I have difficulty processing visual information. Is there a way to get written descriptions of visual aids used in the classroom?",
        "I have ADHD and have difficulty staying organized. Will there be support for creating study schedules and staying on track?",
        "I have a condition that affects my fine motor skills. Are there accommodations available for written assignments and tests?",
        "I have a speech impediment. Will there be opportunities for me to present or participate in class discussions in alternative ways?",
        "I have a condition that causes fatigue. Can I request a flexible attendance policy?",
        "I have a condition that affects my ability to concentrate for long periods. Will there be opportunities to take breaks during class?",
        "I have a condition that affects my ability to process information quickly. Can I request additional time to complete assignments?",
        "My disability makes it challenging for me to take notes. Will this course have peer notetakers?",
        "Will this class have sign language interpretation?",
        "My primary language is ASL. Will this course have ASL accomadation?",
        "Can I get exam adjustments for my disability?",
        "Can I get extra time on exams to accomadate my condition?",
        "Yo, can I get some notetaking help because of my condition?",
        "I struggle with taking notes due to my disability. Is there a system for peer notetaking in this class?",
        "Will there be someone doing sign language interpretation in this course?",
        "ASL is my main language. Are there accommodations for that in this class?",
        "Do y'all offer exam adjustments for disabilities?",
        "Is there a chance I could get extra time on exams because of my condition?",
        "What AEC accommodations are available in this ML course?",
        "How can I let the instructor know about my AEC needs for this course?",
        "What kind of AEC support is provided for students with visual impairments?",
        "Is there a deadline for requesting AEC accommodations in CS 472?",
        "What should I do if I face a barrier to my learning in this ML course?",
        "Can I request an AEC accommodation for a temporary condition in this course?",
        "What if I have a learning disability that affects my performance in this ML course?",
        "What AEC resources or services are available to support me in CS 472?",
        "How will the instructor ensure that the course is accessible to all students, including those who need AEC?",
        "What if I require an AEC accommodation that hasn't been provided before in this course?",
        "How will I know if my request for AEC accommodation has been approved or denied in CS 472?",
        "Are there any course materials that will be modified to accommodate AEC needs?",
        "What if my mental health affects my ability to learn in this ML course?",
        "Will the instructor work with me to develop an AEC plan for this course?",
        "What AEC accommodations are available for remote learners in this ML course?",
        "What kind of help can I get from AEC for this course?",
        "Is AEC gonna help me out if I need extended testing time?",
        "Can I ask for in-person assistance if I need it for CS 472?",
        "What do I need to do to get more flexible class policies through AEC?",
        "Are there any changes to AEC this term for CS 472?",
        "How can AEC make sure I get a quality education in this course?",
        "Can you provide more information about the types of accommodations that the AEC provides for this course?",
        "How can I request accommodations through the AEC for CS 472?",
        "What do I need to do to qualify for accommodations through the AEC for this course?",
        "Are there any accommodations that are commonly requested by students in CS 472?",
        "What should I do if I'm not sure what accommodations I need for CS 472?",
        "Can you tell me more about how the AEC works with instructors to provide accommodations?",
        "Is there anyone I can talk to at the AEC if I have questions about my accommodations?",
        "Are there any specific policies or procedures that I need to follow when requesting accommodations for CS 472?",
        "How will my accommodations be implemented in CS 472?",
        "What should I do if I encounter any issues with my accommodations in CS 472?",
        "who can I talk to about my AEC accomadations?",
        " aec accomadations?",
        "Are AEC accommodations provided for this course?",
        "What if I have a physical disability that prevents me from attending lectures on campus?",
        "How can I let the instructor know about any accommodations I may need for this course?",
        "What kind of accommodations can be made for students with visual impairments?",
        "Is there a deadline for requesting AEC accommodations for the course?",
        "What should I do if I encounter a barrier to full participation in the course?",
        "Can I request an accommodation for a temporary injury or condition that affects my ability to participate in the course?",
        "What if I have a learning disability that impacts my ability to complete assignments?",
        "Are there any resources or services available to help me navigate the course if I have a disability?",
        "How will the instructor ensure that the course is accessible for all students?",
        "What if I need an accommodation that has not been provided before in this course?",
        "How will I know if an accommodation I requested has been approved or denied?",
        "Are there any course materials that may need to be modified to accommodate students with disabilities?",
        "What if I have a mental health condition that affects my ability to participate in the course?",
        "Will the instructor work with me to develop a plan to accommodate my disability throughout the course?",
        "What if my disability prevents me from attending lectures on campus?",
        "In case of a physical disability, how can I access the course content and participate in the course?",
        "What is the process for requesting accommodations in this course?",
        "What steps should I take to let the instructor know about my disability-related needs?",
        "What kind of support can be provided to students with visual impairments?",
        "How can the course content be made accessible for visually impaired students?",
        "When is the deadline for requesting accommodations for the course?",
        "How soon do I need to request AEC accommodations to ensure they will be provided?",
        "How can I address barriers to my full participation in the course?",
        "In case of disability-related challenges, what steps should I take to access the course content and fulfill course requirements?",
        "What if I have a temporary injury or condition that impacts my ability to participate in the course?",
        "Are temporary disabilities eligible for accommodations in the course?",
        "What options are available to help me overcome my learning disability and finish assignments?",
        "In case of learning disabilities, what resources or support can be provided to help me succeed in the course?",
        "What kind of assistance is available for students with disabilities in the course?",
        "How can I access AEC disability services and support for the course?",
        "What measures will be taken to make the course accessible to all students, irrespective of their disabilities?",
        "How will the course content and activities be adapted to accommodate diverse student needs?",
        "What if I need a unique or uncommon accommodation that hasn't been provided before in this course?",
        "Are there any options for accommodations that have not been previously implemented for the course?",
        "What is the process for finding out whether my AEC accommodation request has been granted or not?",
        "Will I receive notification regarding the approval or denial of my accommodation request?",
        "Is any course material adjusted to meet the needs of students with disabilities?",
        "In what ways can the course material be modified to make it more accessible to students with disabilities?",
        "What options are available to support me in participating in the course despite my mental health condition?",
        "What resources are available to help me address my mental health condition and excel in the course?",
        "Can I work with the instructor to create a plan to accommodate my disability throughout the course?",
        "Is it possible to create a AEC accommodation plan in consultation with the instructor to ensure my needs are met?"
      ],
      "responses": [
        "The goal of the class is to be inclusive and accessible to all students, regardless of any disabilities. If a student experiences barriers to full participation or fair evaluation due to a disability, they should inform the instructor so that accommodations can be made. It is also important to inform the instructor early on in the quarter to ensure that appropriate accommodations can be provided. If there are any other obstacles to full participation, students are encouraged to share their concerns with the instructor."
      ]
    },
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hey",
        "Hello",
        "Hello there",
        "Good morning",
        "Good afternoon",
        "Good evening",
        "What's up",
        "Howdy",
        "Greetings",
        "Hi there",
        "Hey there",
        "Good day",
        "What's new",
        "How have you been",
        "Long time no see",
        "Nice to see you",
        "Yo",
        "How's it going",
        "Waddup",
        "Hiya",
        "Sup",
        "'Sup",
        "Hola",
        "Hey, buddy",
        "What's crackin'",
        "How you doin'",
        "Hey, homie",
        "Hiya, how are you?",
        "Hey there, what's new?",
        "Hello, how's it going?",
        "What's up, buddy?",
        "Hey, howdy partner?",
        "Greetings, how have you been?",
        "Good morning, what's crackin'?",
        "Hey there, how you doin'?",
        "Hi, what's good?",
        "What's up, homie?",
        "Hey, how's your day going so far?",
        "Yo, what's the word?",
        "Hiya, what's happening?",
        "Hello, what's been going on?",
        "Hey, how's life treating you?",
        "What's up, my friend?",
        "Hey, what's the scoop?",
        "then what's up",
        "how's the mood?",
        "good day",
        "what's new",
        "hey, homie",
        "what's crackin'",
        "good morning",
        "hey good evening",
        "it's nice to see you",
        "hey, how's life treating you?",
        "i'm glad to meet you",
        "how's the situation?",
        "what is going on?",
        "it's good to see you too",
        "how are you getting on",
        "hey what's up",
        "greetings",
        "what's happened?",
        "nice to see you",
        "what's up, homie?",
        "good night goodbye",
        "how nice to see you",
        "i'm glad to see you",
        "how is your morning so far",
        "nice day don't you think?",
        "goodbye good night",
        "how's your morning going?",
        "hey what's going on?",
        "it's nice to talk to you",
        "how about you",
        "and what's going on?",
        "good to see you again",
        "how is it going",
        "good morning there",
        "hey there, what's new?",
        "great to see you too",
        "what a pleasure to meet you",
        "what's cooking",
        "good what's up",
        "what's up today",
        "hello hi",
        "how has your day been",
        "wassup",
        "what's going on here?",
        "what?",
        "how is it",
        "i asked what's up?",
        "good evening to you",
        "it was very nice to meet you",
        "how is your day",
        "how has your day been going",
        "what a pleasure to chat with you",
        "tonight",
        "how your day is going",
        "have a nice morning",
        "how's this going?",
        "how's life",
        "hey what's up?",
        "hey there, how you doin'?",
        "good tonight",
        "howdy",
        "good morning, what's crackin'?",
        "what's shaking",
        "how nice to talk to you",
        "hola",
        "it is nice talking to you",
        "what's happened",
        "good to see you",
        "happy to meet you",
        "i'm happy to talk to you",
        "how is this going?",
        "hey, howdy partner?",
        "always a pleasure to see you",
        "hope your day is going well",
        "how is everything?",
        "how did the day go?",
        "how's it going?",
        "please sleep well",
        "hey there",
        "great to see you again",
        "nice to see you again",
        "how is your morning going",
        "nice talking to you",
        "how's your mood?",
        "afternoon",
        "good night to you",
        "glad to see you too",
        "what's up, buddy?",
        "heya",
        "all right goodnight",
        "how are things going?",
        "how are you today?",
        "how is your life?",
        "hello, how's it going?",
        "pleased to meet you",
        "how you doin'",
        "how are the things going",
        "how do you feel",
        "how do you do it?",
        "i said what's up",
        "how's it?",
        "how is your day going",
        "how's your evening?",
        "hiya",
        "how are you feeling",
        "what's cooking?",
        "it's an honour to meet you",
        "how's your day?",
        "then what is going on?",
        "it's nice talking to you",
        "just going to say hi",
        "good evening there",
        "how do you do"
      ],
      "responses": [
        "Hello, how can I help you?",
        "Hi there, what can I do for you?",
        "Hi there, how can I help?"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": [
        "Bye",
        "Goodbye",
        "Farewell",
        "So long",
        "See you later",
        "Adios",
        "Ciao",
        "Take care",
        "Peace out",
        "See ya",
        "Later",
        "Have a good one",
        "Talk to you later",
        "TTYL",
        "Adieu",
        "Auf Wiedersehen",
        "Sayonara",
        "Arrivederci",
        "Take it easy",
        "Catch you later"
      ],
      "responses": [
        "See you later, thanks for chatting",
        "Have a nice day",
        "Bye! Come back again soon."
      ]
    },
    {
      "tag": "thanks",
      "patterns": [
        "ty",
        "thx",
        "perfect thank you",
        "much obliged",
        "terrific thank you",
        "thanks for your kindness",
        "thank you my friend",
        "alright thanks",
        "i'm grateful",
        "thank you very much",
        "so nice of you",
        "thanks for your help",
        "i appreciate it",
        "great thank you",
        "thanks buddy",
        "good thanks",
        "i appreciate your continued support",
        "thanx",
        "that's very generous",
        "thank you so much",
        "thank you",
        "all thank you",
        "thnx",
        "all right - thank you",
        "thanks for that",
        "thanks love",
        "thanks for everything",
        "well thanks",
        "thank you for your help",
        "cheers",
        "nice thank you",
        "thank you for your assistance",
        "thanks for it",
        "no thank you that's all",
        "thanks for your assistance",
        "alright thank you",
        "all right thanks",
        "so thank you",
        "you helped a lot thank you",
        "thanks a million",
        "i thank you",
        "thanks a lot",
        "thank you that will be all",
        "very good thank you",
        "thanks a ton",
        "thanks so much",
        "thanks again",
        "thank you again",
        "thanks",
        "thank you for helping",
        "many thanks",
        "thanks for helping",
        "well thank you",
        "thanks for the aid",
        "thank you it's going to be all right",
        "again i really appreciate you",
        "thanks for your time",
        "thanks a lot!",
        "thanks a bunch",
        "thanks for the help",
        "appreciate your help",
        "that's very kind",
        "that's helpful",
        "that's nice of you"
      ],
      "responses": [
        "Happy to help!", 
        "Any time!", 
        "My pleasure"
      ]
    },
    {
      "tag": "professor",
      "patterns": [
        "Is Humphrey Shi the TA?",
        "Is Humphrey Shi the professor?",
        "Who is the professor for this course?",
        "Who is the professor?",
        "What is the professor's name?",
        "who is the instructor",
        "what is the instructor's name?",
        "Who is the professor for CS 472?",
        "Who is the instructor of CS 472?",
        "What is the name of the professor for Computer Science 472?",
        "Computer Science 472's instructor is named?",
        "CS 472's professor is named?",
        "Who teaches this course?",
        "Who is teaching CS 472?",
        "What is the name of the person teaching CS 472?",
        "What is the name of the person teaching this course?",
        "Who is responsible for the lectures in CS 472?",
        "Who leads the lectures in this course?",
        "Who will be my professor for this course?",
        "Who will be my instructor for CS 472?",
        "Do you know who will be teaching this course?",
        "Can you tell me the name of the professor for this course?",
        "Do you know the name of the instructor for Computer Science 472?",
        "Can you tell me who will be responsible for the lectures in this course?",
        "Do you know the name of the instructor for CS 472?",
        "Can you tell me who will be responsible for the lectures in CS 472?",
        "Can you tell me who will be leading the lectures for CS 472?",
        "Who will be my instructor for this course?",
        "Do you know who the professor for CS 472 is?"
      ],
      "responses": [
        "The professor of CS 472 is Humphrey Shi"
      ]
    },
    {
      "tag": "GE",
      "patterns": [
        "Is Steven the TA?",
        "Is Steven Walton the professor?",
        "Who is the GE for this course?",
        "Who is the GE?",
        "What is the GE's name?",
        "who is the TA",
        "what is the TA's name?",
        "Who is the TA for CS 472?",
        "Who is the GE of CS 472?",
        "What is the name of the TA for Computer Science 472?",
        "Computer Science 472's GE is named?",
        "CS 472's TA is named?",
        "Who is the Graduate Employee for this course?",
        "Who is the Teaching Assistant?",
        "What is the Graduate Teacher's name?",
        "who is the Graduate Employee",
        "what is the Teaching Assistant's name?",
        "Who is the Teaching Assistant for CS 472?",
        "Who is the Graduate Teacher of CS 472?",
        "What is the name of the Teaching Assistant for Computer Science 472?",
        "Computer Science 472's Grad Employee is named?",
        "CS 472's Teaching Assistant is named?",
        "Who is the TA for this class?",
        "Who is the GE of this course?",
        "What is the name of the TA for this class?",
        "What is the name of the GE of this course?",
        "Do you know who the GE for this course is?",
        "Can you tell me who the GE is?",
        "I am curious, who is the GE's name?",
        "Can you tell me who the TA is?",
        "Do you know the name of the TA?",
        "Who is the TA for CS 472, do you know?",
        "Do you know who the GE of CS 472 is?",
        "Can you tell me the name of the TA for Computer Science 472?",
        "Do you happen to know the name of Computer Science 472's GE?",
        "I'm not sure, what is the name of CS 472's TA?",
        "Can you tell me who the Graduate Employee for this course is?",
        "Do you know who the Teaching Assistant is?",
        "Could you tell me the Graduate Teacher's name?",
        "I am not sure, who is the Graduate Employee?",
        "Can you tell me the name of the Teaching Assistant?",
        "Who is the Teaching Assistant for CS 472, do you know?",
        "Do you know who the Graduate Teacher of CS 472 is?",
        "Can you tell me the name of the Teaching Assistant for Computer Science 472?",
        "Could you tell me the name of Computer Science 472's Grad Employee?",
        "I'm not sure, what is the name of CS 472's Teaching Assistant?",
        "Do you know who the TA for this class is?",
        "Who is the GE of this course, can you tell me?",
        "What is the name of the TA for this class, do you know?",
        "I'm not sure, what is the name of the GE of this course?"
      ],
      "responses": [
        "The TA of CS 472 is Steven Walton"
      ]
    },
    {
      "tag": "lab",
      "patterns": [
        "Does this course have a lab section?",
        "When is lab?",
        "What time does lab start?",
        "What time does discussion section start?",
        "What time does lab end?",
        "What time does discussion section end?",
        "Does this course have a discussion section?",
        "who leads the lab section?",
        "when is discussion section?",
        "Do we have to attend any extra sessions for this course?",
        "Are there any labs or discussions for this class?",
        "Is there anything besides lectures for this course?",
        "Are there any other meetings or activities we have to attend?",
        "Is there a lab or discussion component for this class?",
        "Do we have any group work for this course?",
        "Is there any required collaboration or group meetings for this class?",
        "Are there any other required activities for this course?",
        "Is there a separate instructor for labs or discussions?",
        "Does CS 472 have a lab section?",
        "Are there any required labs for CS 472?",
        "Will we have any graded discussions in CS 472?",
        "Who leads the lab sections for CS 472?",
        "Are there any prerequisites for the lab section in CS 472?",
        "When and where are the discussion sections held for CS 472?",
        "Do we have to attend the lab section to pass CS 472?",
        "What topics will be covered in the discussion section for CS 472?",
        "Are there any online resources for the labs of CS 472?",
        "Are there any additional materials needed for the discussion section in CS 472?",
        "Will the lab section of CS 472 involve any group work or collaboration?",
        "Can you tell me if this course has a lab section?",
        "Do you know when lab starts for this course?",
        "Can you tell me at what time lab begins?",
        "Can you tell me at what time discussion section begins?",
        "Do you know what time lab ends for this course?",
        "Do you know what time discussion section ends for this course?",
        "Do you know if this course has a discussion section?",
        "Who leads the lab section? Can you tell me?",
        "Can you tell me when the discussion section is scheduled for this course?",
        "Do you know if there is a lab or discussion component for this course?",
        "Can you tell me whether there is a separate instructor for labs or discussions?",
        "Do you know if CS 472 has a lab section?",
        "Can you tell me if there are any required labs for CS 472?",
        "Can you tell me if we have any graded discussions in CS 472?"
      ],
      "responses": [
        "CS 472 does not have a lab or discussion section"
      ]
    },
    {
      "tag": "lectures",
      "patterns": [
        "is there class on monday?",
        "do we have class tomorrow?",
        "When will class start?",
        "When is class?",
        "What days are classes?",
        "What time is lecture?",
        "What days are lectures?",
        "How often are lectures?",
        "How long are lectures?",
        "What time does lecture start?",
        "What time does lecture end?",
        "When are lectures?",
        "When do lectures start?",
        "When do lectures end?",
        "Are lectures on the same days every week?",
        "What is the schedule for lectures?",
        "When does CS 472 have lectures?",
        "When is the next lecture for CS 472?",
        "What is the lecture schedule for CS 472?",
        "Are lectures held on weekends?",
        "Is there a set time for lectures?",
        "When is lecture time for CS 472?",
        "Yo, when's class?",
        "When do we gotta show up for this thing?",
        "What's the deal with class times?",
        "When do we gotta be in class?",
        "What's the lecture schedule look like?",
        "How many times a week we gotta show up?",
        "What's the deal with lecture times?",
        "When do we gotta be in lecture?",
        "What time does this thing start?",
        "What time do we gotta be there?",
        "What time do we get out of lecture?",
        "When do we have lectures?",
        "When do lectures kick off?",
        "When do we wrap up lectures?",
        "Do we have the same lecture schedule every week?",
        "What's the plan for lectures?",
        "What's the lowdown on lecture times?",
        "When do we start lectures?",
        "When do lectures finish up?",
        "What's the lecture timetable like?",
        "Do you know when class is?",
        "Can you tell me what days the classes are?",
        "What time is lecture? Can you tell me?",
        "Can you tell me which days lectures are held?",
        "Do you know how often lectures occur?",
        "How long do lectures usually last? Do you know?",
        "Can you tell me what time lecture starts?",
        "Can you tell me what time lecture ends?",
        "Can you inform me about when lectures are scheduled?",
        "Do you know when lectures start?",
        "Do you know when lectures end?",
        "Are lectures scheduled on the same days every week? Do you know?",
        "What is the lecture schedule like? Can you tell me?",
        "When does CS 472 have lectures? Do you know?",
        "Do you know when the next lecture for CS 472 is?",
        "Can you inform me about the lecture schedule for CS 472?",
        "Are lectures held on weekends? Do you know?",
        "Is there a set time for lectures? Can you tell me?",
        "When is the lecture time for CS 472? Do you know?",
        "Yo, can you tell me when class is?",
        "When do we have to show up for this thing? Do you know?",
        "What's the deal with class times? Can you inform me?",
        "When do we have to be in class? Can you tell me?",
        "What's the lecture schedule look like? Do you know?",
        "How many times a week do we have to show up? Can you tell me?",
        "What's the deal with lecture times? Can you inform me?",
        "When do we have to be in lecture? Can you tell me?",
        "What time does this thing start? Do you know?",
        "What time do we have to be there? Can you inform me?",
        "What time do we get out of lecture? Can you tell me?",
        "Do you know when we have lectures?",
        "When do lectures kick off? Can you tell me?",
        "When do we wrap up lectures? Do you know?",
        "Do we have the same lecture schedule every week? Can you tell me?",
        "What's the plan for lectures? Can you inform me?",
        "What's the lowdown on lecture times? Can you tell me?",
        "When do we start lectures? Can you inform me?",
        "When do lectures finish up? Do you know?",
        "What's the lecture timetable like? Can you inform me?"
      ],
      "responses": [
        "Two lectures are delivered in person every week on Tuesdays and Thursdays, from 4:00 PM to 5:20 PM"
      ]
    },
    {
      "tag": "prerequisites",
      "patterns": [
        "Do I need to have taken anything before this class?",
        "Are there any courses I should take first?",
        "Is there anything I need to know before enrolling?",
        "What do I need to know before I start this course?",
        "Can I take this class without taking any prerequisites?",
        "Do I need any background knowledge for this course?",
        "What are the requirements to take this class?",
        "Are there any classes I should have taken before this one?",
        "Is there any prior knowledge I should have before enrolling?",
        "What courses should I have taken before registering for this class?",
        "Can I take this course if I haven't taken any prerequisites?",
        "What are the prereqs for this class?",
        "Is there anything I need to know before starting this course?",
        "What should I know before taking this class?",
        "What courses are necessary for this class?",
        "Is there anything I should study before this course?",
        "What do I need to have learned before enrolling?",
        "What classes are recommended before taking this one?",
        "Are there any prerequisites I need to fulfill for this course?",
        "What knowledge or skills are required for this class?",
        "Prerequisites?",
        "Prereqs?",
        "Any prereqs for this course?",
        "Does this course have prerequisites?",
        "what are the prereqs for CS 472?",
        "What do I need to take before taking CS 472?",
        "Are there any prerequisites for CS 472?",
        "What are the requirements to take CS 472?",
        "Do I need any other classes to take CS 472?",
        "What classes should I take before enrolling in CS 472?",
        "What do I need to know before taking CS 472?",
        "What are the pre-requisites for CS 472?",
        "Is there any prior knowledge required for CS 472?",
        "What background is necessary for CS 472?",
        "Can I take CS 472 without taking any other classes?",
        "Do I need to have taken any other courses to enroll in CS 472?",
        "What classes are a must before taking CS 472?",
        "Is CIS 315 a requirement for CS 472?",
        "Do I need to have completed CIS 315 to take CS 472?",
        "Is any prior knowledge necessary for CS 472?",
        "What are the entry requirements for CS 472?",
        "Is it possible to take CS 472 without having taken CIS 315?",
        "Is CIS 315 a pre-requisite for CS 472?",
        "Can you tell me if I need to have taken anything before this class?",
        "Do you know if there are any courses I should take first?",
        "Can you inform me if there is anything I need to know before enrolling?",
        "What do I need to know before I start this course? Can you tell me?",
        "Can you tell me if I can take this class without taking any prerequisites?",
        "Do you know if I need any background knowledge for this course?",
        "Can you provide me with the requirements to take this class?",
        "Are there any classes I should have taken before this one, can you tell me?",
        "Do you know if there is any prior knowledge I should have before enrolling?",
        "Can you tell me what courses I should have taken before registering for this class?",
        "Can you inform me if I can take this course if I haven't taken any prerequisites?",
        "What are the prereqs for this class, do you know?",
        "Can you tell me if there is anything I need to know before starting this course?",
        "What should I know before taking this class? Can you tell me?",
        "Can you provide me with the courses that are necessary for this class?",
        "Do you know if there is anything I should study before this course?",
        "What do I need to have learned before enrolling? Can you tell me?",
        "Can you inform me what classes are recommended before taking this one?",
        "Can you tell me if there are any prerequisites I need to fulfill for this course?",
        "Can you provide me with the knowledge or skills required for this class?"
      ],
      "responses": [
        "The pre-requisites for CIS 472 is CIS 315 (Intermediate Algorithms) or equivalent. While not required, we recommend that students feel comfortable programming in Python and are comfortable with math subjects like Linear Algebra."
      ]
    },
    {
      "tag": "textbook",
      "patterns": [
        "Where can I buy the course textbook?",
        "What are the required texts for CS 472?",
        "Does CS 472 have any required textbooks?",
        "What textbooks do I need for this class?",
        "What books are required for the course?",
        "What materials are necessary for CS 472?",
        "What is the recommended reading for CS 472?",
        "Are there any textbooks for this course?",
        "Is there a book that is required for this course?",
        "What is the required literature for CS 472?",
        "What reading materials are needed for this course?",
        "Do I need to purchase any books for this class?",
        "What are the recommended materials for CS 472?",
        "What is the course's reading list?",
        "Are there recommended books for this course?",
        "Is there any reading material that is recommended for this class?",
        "What is the suggested reading for this course?",
        "What literature is suggested for this course?",
        "What is the textbook policy for this course?",
        "Do I need to buy any textbooks for CS 472?",
        "Are there any recommended books for this course?",
        "Can you tell me which textbooks are required for CS 472?",
        "Do you know if there are any required textbooks for CS 472?",
        "What books do I need to purchase for this course?",
        "Could you tell me what materials are required for this course?",
        "Can you inform me of the recommended readings for CS 472?",
        "Are there any textbooks that I need to get for this course?",
        "What is the policy regarding textbooks for CS 472?",
        "Can you tell me if there's a specific book required for this course?",
        "What literature do I need to have for CS 472?",
        "What are the required reading materials for this course?",
        "Do I need to buy any books or textbooks for CS 472?",
        "What materials are recommended for CS 472?",
        "Can you give me the reading list for this course?",
        "Are there any books that you would recommend for this course?",
        "What materials are suggested for this class?",
        "What is the suggested literature for this class?",
        "Could you tell me what the textbook requirements are for this course?",
        "Is it necessary to purchase any textbooks for CS 472?",
        "Are there any particular books recommended for this course?",
        "What are the book requirements for CS 472?"
      ],
      "responses": [
        "There is no required text for CIS 472, but you will be expected to find and read a variety of technical documents required for your project."
      ]
    }, 
    {
      "tag": "sick",
      "patterns": [
        "I do not feel well. What should I do?",
        "I have a fever. Can I come to class?",
        "What should I do if I test positive for COVID-19 or have been in close contact with someone who has tested positive?",
        "Can I still attend class if I have been in close contact with someone who has tested positive for COVID-19?",
        "How can I access University Health Services or the University Counseling Center?",
        "What should I do if I experience symptoms of COVID-19?",
        "What steps should I take if I am feeling unwell?",
        "Is it safe for me to attend class if I have a fever?",
        "What actions should I take if I have tested positive for COVID-19 or been in contact with someone who has?",
        "If I have been exposed to someone who tested positive for COVID-19, am I still allowed to come to class?",
        "What are the protocols for attending class if I am experiencing COVID-19 symptoms?",
        "Should I still come to class if I'm feeling sick?",
        "What should I do if I suspect I have contracted COVID-19?",
        "What are the guidelines for attending class if I have been in contact with a COVID-19 positive person?",
        "If I have a cough, can I attend class?",
        "What is the policy for attending class if I have been exposed to someone with COVID-19?",
        "What measures should I take if I have COVID-19 symptoms?",
        "Is it advisable to attend class if I have a sore throat?",
        "If I feel unwell, what should I do about attending class?",
        "Can I still attend class if I have recently traveled to a high-risk COVID-19 area?",
        "What should I do if I have been in close contact with someone who is experiencing COVID-19 symptoms?",
        "If I am feeling sick, should I attend class remotely or in-person?",
        "What should I do if I develop COVID-19 symptoms during class?",
        "Should I come to class if I have a headache?",
        "If I have a stuffy nose, can I still attend class?",
        "I have been sick but am feeling better now. Can I come to school if I wear a mask?",
        "I recently recovered from an illness, can I attend school if I wear a mask?",
        "If I have been sick but am feeling better, can I still go to school if I wear a mask?",
        "Is it safe for me to attend school if I have recently been sick but am now wearing a mask?",
        "Can I go to school if I have been sick but am now wearing a mask to prevent the spread of illness?",
        "If I wear a mask, am I able to attend school even if I have been sick?",
        "What should I do if I am experiencing any COVID-19 symptoms prior to attending class?"
      ],
      "responses": [
        "Do not come to class if you are experiencing symptoms of Covid-19 or have been in close contact with someone who has tested positive for Covid-19."
      ]
    },
    {
      "tag": "masks",
      "patterns": [
        "Should I wear a mask to lecture?",
        "Are face coverings required?",
        "Some people in class are not wearing masks. Is this ok?",
        "Do I have to wear a face covering in lecture?",
        "Is it mandatory to wear a mask during lectures?",
        "Do I need to wear a face covering in class?",
        "What is the policy regarding wearing masks in lectures?",
        "Are students required to wear face masks during lectures?",
        "If I choose not to wear a mask during lectures, will there be any consequences?",
        "Is it advisable to wear a mask during lecture?",
        "Do I need to have a face covering on while attending?",
        "Is it acceptable for some individuals in the class not to wear masks?",
        "Is it compulsory to wear a face covering during lecture sessions?",
        "Are masks mandatory during lectures?",
        "Are face masks required in classroom settings?",
        "What is the protocol on wearing masks during lectures?",
        "Do students have to wear masks in lecture halls?",
        "Will there be any repercussions if I opt not to wear a mask during lecture?",
        "Wear mask in lecture, yes or no?",
        "Need face coverings or nah?",
        "Some people not wear masks in class, ok?",
        "Have to wear face covering in lecture or what?",
        "Mask mandatory during lectures, right?",
        "Need wear face covering in class or not?",
        "Policy for wearing masks in lectures, what is it?",
        "Students gotta wear face masks in lectures or not?",
        "No mask in lecture, what happens?",
        "Mask in lecture, good idea or nah?",
        "Need face covering when attending or not?",
        "Ok for some peeps not wear masks in class or no?",
        "Gotta wear face covering during lecture sessions, right?",
        "Masks mandatory during lectures or nah?",
        "Face masks required in classroom settings, yes or no?",
        "Protocol for wearing masks during lectures, what's up?",
        "Students required to wear masks in lecture halls or no?",
        "No mask in lecture, any consequences or nah?"
      ],
      "responses": [
        "Face masks are not required but are highly encouraged."
      ]
    }     
  ]
}
