{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hey",
        "Hello",
        "Hello there",
        "Good morning",
        "Good afternoon",
        "Good evening",
        "What's up",
        "Howdy",
        "Greetings",
        "Hi there",
        "Hey there",
        "Good day",
        "What's new",
        "How have you been",
        "Long time no see",
        "Nice to see you",
        "Yo",
        "How's it going",
        "Waddup",
        "Hiya",
        "Sup",
        "'Sup",
        "Hola",
        "Hey, buddy",
        "What's crackin'",
        "How you doin'",
        "Hey, homie",
        "Hiya, how are you?",
        "Hey there, what's new?",
        "Hello, how's it going?",
        "What's up, buddy?",
        "Hey, howdy partner?",
        "Greetings, how have you been?",
        "Good morning, what's crackin'?",
        "Hey there, how you doin'?",
        "Hi, what's good?",
        "What's up, homie?",
        "Hey, how's your day going so far?",
        "Yo, what's the word?",
        "Hiya, what's happening?",
        "Hello, what's been going on?",
        "Hey, how's life treating you?",
        "What's up, my friend?",
        "Hey, what's the scoop?"
      ],
      "responses": [
        "Hello, how can I help you?",
        "Hi there, what can I do for you?",
        "Hi there, how can I help?"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": [
        "Bye",
        "Goodbye",
        "Farewell",
        "So long",
        "See you later",
        "Adios",
        "Ciao",
        "Take care",
        "Peace out",
        "See ya",
        "Later",
        "Have a good one",
        "Talk to you later",
        "TTYL",
        "Adieu",
        "Auf Wiedersehen",
        "Sayonara",
        "Arrivederci",
        "Take it easy",
        "Catch you later"
      ],
      "responses": [
        "See you later, thanks for chatting",
        "Have a nice day",
        "Bye! Come back again soon."
      ]
    },
    {
      "tag": "thanks",
      "patterns": [
        "Thanks",
        "Thank you",
        "Thanks a lot",
        "Many thanks",
        "I appreciate it",
        "Thanks a bunch",
        "Cheers",
        "Thanks for your help",
        "Thanks for your time",
        "Thanks for everything",
        "Thanks a million",
        "Thanks so much",
        "That's very kind",
        "That's very generous",
        "That's helpful",
        "Thanks a ton",
        "Thank you very much",
        "Thanks for your kindness",
        "Much obliged",
        "Thanks a lot!",
        "Thank you for your help"
      ],
      "responses": [
        "Happy to help!", 
        "Any time!", 
        "My pleasure"
      ]
    },
    {
      "tag": "professor",
      "patterns": [
        "Who is the professor for this course?",
        "Who is the professor?",
        "What is the professor's name?",
        "who is the instructor",
        "what is the instructor's name?",
        "Who is the professor for CS 472?",
        "Who is the instructor of CS 472?",
        "What is the name of the professor for Computer Science 472?",
        "Computer Science 472's instructor is named?",
        "CS 472's professor is named?",
        "Who teaches this course?",
        "Who is teaching CS 472?",
        "What is the name of the person teaching CS 472?",
        "What is the name of the person teaching this course?",
        "Who is responsible for the lectures in CS 472?",
        "Who leads the lectures in this course?",
        "Who will be my professor for this course?",
        "Who will be my instructor for CS 472?",
        "Do you know who will be teaching this course?",
        "Can you tell me the name of the professor for this course?",
        "Do you know the name of the instructor for Computer Science 472?",
        "Can you tell me who will be responsible for the lectures in this course?",
        "Do you know the name of the instructor for CS 472?",
        "Can you tell me who will be responsible for the lectures in CS 472?",
        "Can you tell me who will be leading the lectures for CS 472?",
        "Who will be my instructor for this course?",
        "Do you know who the professor for CS 472 is?"
      ],
      "responses": [
        "The professor of CS 472 is Humphrey Shi"
      ]
    },
    {
      "tag": "GE",
      "patterns": [
        "Who is the GE for this course?",
        "Who is the GE?",
        "What is the GE's name?",
        "who is the TA",
        "what is the TA's name?",
        "Who is the TA for CS 472?",
        "Who is the GE of CS 472?",
        "What is the name of the TA for Computer Science 472?",
        "Computer Science 472's GE is named?",
        "CS 472's TA is named?",
        "Who is the Graduate Employee for this course?",
        "Who is the Teaching Assistant?",
        "What is the Graduate Teacher's name?",
        "who is the Graduate Employee",
        "what is the Teaching Assistant's name?",
        "Who is the Teaching Assistant for CS 472?",
        "Who is the Graduate Teacher of CS 472?",
        "What is the name of the Teaching Assistant for Computer Science 472?",
        "Computer Science 472's Grad Employee is named?",
        "CS 472's Teaching Assistant is named?",
        "Who is the TA for this class?",
        "Who is the GE of this course?",
        "What is the name of the TA for this class?",
        "What is the name of the GE of this course?",
        "Do you know who the GE for this course is?",
        "Can you tell me who the GE is?",
        "I am curious, who is the GE's name?",
        "Can you tell me who the TA is?",
        "Do you know the name of the TA?",
        "Who is the TA for CS 472, do you know?",
        "Do you know who the GE of CS 472 is?",
        "Can you tell me the name of the TA for Computer Science 472?",
        "Do you happen to know the name of Computer Science 472's GE?",
        "I'm not sure, what is the name of CS 472's TA?",
        "Can you tell me who the Graduate Employee for this course is?",
        "Do you know who the Teaching Assistant is?",
        "Could you tell me the Graduate Teacher's name?",
        "I am not sure, who is the Graduate Employee?",
        "Can you tell me the name of the Teaching Assistant?",
        "Who is the Teaching Assistant for CS 472, do you know?",
        "Do you know who the Graduate Teacher of CS 472 is?",
        "Can you tell me the name of the Teaching Assistant for Computer Science 472?",
        "Could you tell me the name of Computer Science 472's Grad Employee?",
        "I'm not sure, what is the name of CS 472's Teaching Assistant?",
        "Do you know who the TA for this class is?",
        "Who is the GE of this course, can you tell me?",
        "What is the name of the TA for this class, do you know?",
        "I'm not sure, what is the name of the GE of this course?"
      ],
      "responses": [
        "The TA of CS 472 is Steven Walton"
      ]
    },
    {
      "tag": "lab",
      "patterns": [
        "Does this course have a lab section?",
        "When is lab?",
        "What time does lab start?",
        "What time does discussion section start?",
        "What time does lab end?",
        "What time does discussion section end?",
        "Does this course have a discussion section?",
        "who leads the lab section?",
        "when is discussion section?",
        "Do we have to attend any extra sessions for this course?",
        "Are there any labs or discussions for this class?",
        "Is there anything besides lectures for this course?",
        "Are there any other meetings or activities we have to attend?",
        "Is there a lab or discussion component for this class?",
        "Do we have any group work for this course?",
        "Is there any required collaboration or group meetings for this class?",
        "Are there any other required activities for this course?",
        "Is there a separate instructor for labs or discussions?",
        "Does CS 472 have a lab section?",
        "Are there any required labs for CS 472?",
        "Will we have any graded discussions in CS 472?",
        "Who leads the lab sections for CS 472?",
        "Are there any prerequisites for the lab section in CS 472?",
        "When and where are the discussion sections held for CS 472?",
        "Do we have to attend the lab section to pass CS 472?",
        "What topics will be covered in the discussion section for CS 472?",
        "Are there any online resources for the labs of CS 472?",
        "Are there any additional materials needed for the discussion section in CS 472?",
        "Will the lab section of CS 472 involve any group work or collaboration?",
        "Can you tell me if this course has a lab section?",
        "Do you know when lab starts for this course?",
        "Can you tell me at what time lab begins?",
        "Can you tell me at what time discussion section begins?",
        "Do you know what time lab ends for this course?",
        "Do you know what time discussion section ends for this course?",
        "Do you know if this course has a discussion section?",
        "Who leads the lab section? Can you tell me?",
        "Can you tell me when the discussion section is scheduled for this course?",
        "Do you know if there is a lab or discussion component for this course?",
        "Can you tell me whether there is a separate instructor for labs or discussions?",
        "Do you know if CS 472 has a lab section?",
        "Can you tell me if there are any required labs for CS 472?",
        "Can you tell me if we have any graded discussions in CS 472?"
      ],
      "responses": [
        "CS 472 does not have a lab or discussion section"
      ]
    },
    {
      "tag": "lectures",
      "patterns": [
        "When is class?",
        "What days are classes?",
        "What time is lecture?",
        "What days are lectures?",
        "How often are lectures?",
        "How long are lectures?",
        "What time does lecture start?",
        "What time does lecture end?",
        "When are lectures?",
        "When do lectures start?",
        "When do lectures end?",
        "Are lectures on the same days every week?",
        "What is the schedule for lectures?",
        "When does CS 472 have lectures?",
        "When is the next lecture for CS 472?",
        "What is the lecture schedule for CS 472?",
        "Are lectures held on weekends?",
        "Is there a set time for lectures?",
        "When is lecture time for CS 472?",
        "Yo, when's class?",
        "When do we gotta show up for this thing?",
        "What's the deal with class times?",
        "When do we gotta be in class?",
        "What's the lecture schedule look like?",
        "How many times a week we gotta show up?",
        "What's the deal with lecture times?",
        "When do we gotta be in lecture?",
        "What time does this thing start?",
        "What time do we gotta be there?",
        "What time do we get out of lecture?",
        "When do we have lectures?",
        "When do lectures kick off?",
        "When do we wrap up lectures?",
        "Do we have the same lecture schedule every week?",
        "What's the plan for lectures?",
        "What's the lowdown on lecture times?",
        "When do we start lectures?",
        "When do lectures finish up?",
        "What's the lecture timetable like?",
        "Do you know when class is?",
        "Can you tell me what days the classes are?",
        "What time is lecture? Can you tell me?",
        "Can you tell me which days lectures are held?",
        "Do you know how often lectures occur?",
        "How long do lectures usually last? Do you know?",
        "Can you tell me what time lecture starts?",
        "Can you tell me what time lecture ends?",
        "Can you inform me about when lectures are scheduled?",
        "Do you know when lectures start?",
        "Do you know when lectures end?",
        "Are lectures scheduled on the same days every week? Do you know?",
        "What is the lecture schedule like? Can you tell me?",
        "When does CS 472 have lectures? Do you know?",
        "Do you know when the next lecture for CS 472 is?",
        "Can you inform me about the lecture schedule for CS 472?",
        "Are lectures held on weekends? Do you know?",
        "Is there a set time for lectures? Can you tell me?",
        "When is the lecture time for CS 472? Do you know?",
        "Yo, can you tell me when class is?",
        "When do we have to show up for this thing? Do you know?",
        "What's the deal with class times? Can you inform me?",
        "When do we have to be in class? Can you tell me?",
        "What's the lecture schedule look like? Do you know?",
        "How many times a week do we have to show up? Can you tell me?",
        "What's the deal with lecture times? Can you inform me?",
        "When do we have to be in lecture? Can you tell me?",
        "What time does this thing start? Do you know?",
        "What time do we have to be there? Can you inform me?",
        "What time do we get out of lecture? Can you tell me?",
        "Do you know when we have lectures?",
        "When do lectures kick off? Can you tell me?",
        "When do we wrap up lectures? Do you know?",
        "Do we have the same lecture schedule every week? Can you tell me?",
        "What's the plan for lectures? Can you inform me?",
        "What's the lowdown on lecture times? Can you tell me?",
        "When do we start lectures? Can you inform me?",
        "When do lectures finish up? Do you know?",
        "What's the lecture timetable like? Can you inform me?"
      ],
      "responses": [
        "Two lectures are delivered in person every week on Tuesdays and Thursdays, from 4:00 PM to 5:20 PM"
      ]
    },
    {
      "tag": "prerequisites",
      "patterns": [
        "Do I need to have taken anything before this class?",
        "Are there any courses I should take first?",
        "Is there anything I need to know before enrolling?",
        "What do I need to know before I start this course?",
        "Can I take this class without taking any prerequisites?",
        "Do I need any background knowledge for this course?",
        "What are the requirements to take this class?",
        "Are there any classes I should have taken before this one?",
        "Is there any prior knowledge I should have before enrolling?",
        "What courses should I have taken before registering for this class?",
        "Can I take this course if I haven't taken any prerequisites?",
        "What are the prereqs for this class?",
        "Is there anything I need to know before starting this course?",
        "What should I know before taking this class?",
        "What courses are necessary for this class?",
        "Is there anything I should study before this course?",
        "What do I need to have learned before enrolling?",
        "What classes are recommended before taking this one?",
        "Are there any prerequisites I need to fulfill for this course?",
        "What knowledge or skills are required for this class?",
        "Prerequisites?",
        "Prereqs?",
        "Any prereqs for this course?",
        "Does this course have prerequisites?",
        "what are the prereqs for CS 472?",
        "What do I need to take before taking CS 472?",
        "Are there any prerequisites for CS 472?",
        "What are the requirements to take CS 472?",
        "Do I need any other classes to take CS 472?",
        "What classes should I take before enrolling in CS 472?",
        "What do I need to know before taking CS 472?",
        "What are the pre-requisites for CS 472?",
        "Is there any prior knowledge required for CS 472?",
        "What background is necessary for CS 472?",
        "Can I take CS 472 without taking any other classes?",
        "Do I need to have taken any other courses to enroll in CS 472?",
        "What classes are a must before taking CS 472?",
        "Is CIS 315 a requirement for CS 472?",
        "Do I need to have completed CIS 315 to take CS 472?",
        "Is any prior knowledge necessary for CS 472?",
        "What are the entry requirements for CS 472?",
        "Is it possible to take CS 472 without having taken CIS 315?",
        "Is CIS 315 a pre-requisite for CS 472?",
        "Can you tell me if I need to have taken anything before this class?",
        "Do you know if there are any courses I should take first?",
        "Can you inform me if there is anything I need to know before enrolling?",
        "What do I need to know before I start this course? Can you tell me?",
        "Can you tell me if I can take this class without taking any prerequisites?",
        "Do you know if I need any background knowledge for this course?",
        "Can you provide me with the requirements to take this class?",
        "Are there any classes I should have taken before this one, can you tell me?",
        "Do you know if there is any prior knowledge I should have before enrolling?",
        "Can you tell me what courses I should have taken before registering for this class?",
        "Can you inform me if I can take this course if I haven't taken any prerequisites?",
        "What are the prereqs for this class, do you know?",
        "Can you tell me if there is anything I need to know before starting this course?",
        "What should I know before taking this class? Can you tell me?",
        "Can you provide me with the courses that are necessary for this class?",
        "Do you know if there is anything I should study before this course?",
        "What do I need to have learned before enrolling? Can you tell me?",
        "Can you inform me what classes are recommended before taking this one?",
        "Can you tell me if there are any prerequisites I need to fulfill for this course?",
        "Can you provide me with the knowledge or skills required for this class?"
      ],
      "responses": [
        "The pre-requisites for CIS 472 is CIS 315 (Intermediate Algorithms) or equivalent. While not required, we recommend that students feel comfortable programming in Python and are comfortable with math subjects like Linear Algebra."
      ]
    },
    {
      "tag": "textbook",
      "patterns": [
        "What are the required texts for CS 472?",
        "Does CS 472 have any required textbooks?",
        "What textbooks do I need for this class?",
        "What books are required for the course?",
        "What materials are necessary for CS 472?",
        "What is the recommended reading for CS 472?",
        "Are there any textbooks for this course?",
        "Is there a book that is required for this course?",
        "What is the required literature for CS 472?",
        "What reading materials are needed for this course?",
        "Do I need to purchase any books for this class?",
        "What are the recommended materials for CS 472?",
        "What is the course's reading list?",
        "Are there recommended books for this course?",
        "Is there any reading material that is recommended for this class?",
        "What is the suggested reading for this course?",
        "What literature is suggested for this course?",
        "What is the textbook policy for this course?",
        "Do I need to buy any textbooks for CS 472?",
        "Are there any recommended books for this course?",
        "Can you tell me which textbooks are required for CS 472?",
        "Do you know if there are any required textbooks for CS 472?",
        "What books do I need to purchase for this course?",
        "Could you tell me what materials are required for this course?",
        "Can you inform me of the recommended readings for CS 472?",
        "Are there any textbooks that I need to get for this course?",
        "What is the policy regarding textbooks for CS 472?",
        "Can you tell me if there's a specific book required for this course?",
        "What literature do I need to have for CS 472?",
        "What are the required reading materials for this course?",
        "Do I need to buy any books or textbooks for CS 472?",
        "What materials are recommended for CS 472?",
        "Can you give me the reading list for this course?",
        "Are there any books that you would recommend for this course?",
        "What materials are suggested for this class?",
        "What is the suggested literature for this class?",
        "Could you tell me what the textbook requirements are for this course?",
        "Is it necessary to purchase any textbooks for CS 472?",
        "Are there any particular books recommended for this course?",
        "What are the book requirements for CS 472?"
      ],
      "responses": [
        "There is no required text for CIS 472, but you will be expected to find and read a variety of technical documents required for your project."
      ]
    }    
  ]
}
